Revit 2024 API
FamilySizeTable Members
The FamilySizeTable type exposes the following members.
Methods
Name | Description
AsValueString
 Gets the table cell value as a string.
Dispose
Releases all resources used by the FamilySizeTable
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetColumnHeader
 Gets a column of the table at at given index.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidColumnIndex
 Checks if the column index is valid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberOfColumns
 Number of columns in the table.
NumberOfRows
 Number of rows in the table.
See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace